In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [3]:
# 결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 
#그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 
#median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라

In [17]:
df.isnull().sum()

df = df.dropna()
result = df.iloc[:int(len(df) * 0.7)]
round(result['median_income'].quantile(0.25),2)

np.float64(2.51)

In [32]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

In [33]:
# 1990년도는 해당년도 평균 이하 GDP를 가지지만,
# 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라

In [51]:
df_1990 = df[df['Year'] == 1990]
df_2010 = df[df['Year'] == 2010]

df_1990_result = df_1990[df_1990['Value'].mean() >= df_1990['Value']]
df_2010_result = df_2010[df_2010['Value'].mean() <= df_2010['Value']]

print(set(df_1990_result['Country Code']) & set(df_2010_result['Country Code']))

{'CHN', 'TEA', 'BRA', 'EAP', 'MEA'}

In [52]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

In [53]:
# 데이터에서 결측치가 가장 많은 컬럼을 출력하라

In [54]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass         55
Name           61
Sex            64
Age            44
SibSp          55
Parch          53
Ticket         34
Fare           69
Cabin          58
Embarked       49
dtype: int64

In [55]:
# 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. 
#-3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 
#약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다.
#위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [72]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

In [73]:
df['diff'] = df['투약후'] - df['투약전']
df

           ID     투약전     투약후   diff
0      user_1  55.137  56.106  0.969
1      user_2  66.584  60.409 -6.175
2      user_3  52.259  50.639 -1.620
3      user_4  77.081  69.164 -7.917
4      user_5  62.677  57.622 -5.055
..        ...     ...     ...    ...
230  user_231  78.041  81.021  2.980
231  user_232  77.187  68.417 -8.770
232  user_233  50.640  51.139  0.499
233  user_234  58.133  49.653 -8.480
234  user_235  55.422  55.179 -0.243

[235 rows x 4 columns]

In [81]:
# -3이하 : A등급 # -3초과   0이하 : B등급, 0 초과 : C등급. 

def g(x):
    if x <= -3:
        return 'A등급'
    if x <= 0 and x >= -3:
        return 'B등급'
    else:
        return 'C등급'

df['등급'] = df['diff'].apply(g)

In [82]:
df['등급'].value_counts()

등급
A등급    121
B등급     67
C등급     47
Name: count, dtype: int64

In [94]:
df_colums = df['등급'].value_counts()
total = df_colums.sum()

expect = [total * 0.5 , total * 0.25 , total *0.25]

from scipy.stats import chisquare
stats, p = chisquare(df_colums, expect)
print(round(stats,3))
print(round(p,3))

if 0.164 > 0.05:
    print("귀무")
else:
    print("대립")

3.613
0.164
귀무

In [95]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

In [96]:
# A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)

In [102]:
df_A = df[df['group'] == 'A']['rpm']
df_B = df[df['group'] == 'B']['rpm']

from scipy.stats import shapiro

print(shapiro(df_A))
print(shapiro(df_B))

ShapiroResult(statistic=np.float64(0.9863896921013734), pvalue=np.float64(0.3979080924239819))
ShapiroResult(statistic=np.float64(0.9943944976838186), pvalue=np.float64(0.9562843067714428))

In [103]:
# A,B 공장 생산 제품의 rpm은 등분산성 가지는가 . (각 공장의 pvalue 출력할 것)

In [106]:
from scipy.stats import levene

stats, p = levene(df_A,df_B)
print(p)

0.9038351280607178

In [107]:
# 대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. 
#pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라*

In [110]:
from scipy.stats import ttest_rel

stats, p = ttest_rel(df_B,df_A, alternative = 'greater')
print(p)

0.00892720834671119